const proper = {
    "위대한 루시드의 소울": 114,
    "위대한 매그너스의 소울": 41402,
    "위대한 반반의 소울": 62103,
    "위대한 카리아인의 소울": 82805,
    "죽음의데스로이드(남) 교환권": 2070,
    "죽음의데스로이드(여) 교환권": 207,
    "앨리스와 토끼 모자 의자": 8280,
    "나랑 놀자 핑! 의자": 10351,
    "부들 초코곰 라이딩 (90일) 교환권": 41402,
    "부들 초코곰 라이딩 (영구) 교환권": 4140,
    "부들 라떼곰 라이딩 (90일) 교환권": 41402,
    "부들 라떼곰 라이딩 (영구) 교환권": 4140,
    "흐물냥 데미지 스킨": 10351,
    "투명 데미지 스킨": 10351,
    "매지컬 한손무기 공격력 주문서": 4658,
    "매지컬 두손무기 공격력 주문서": 4658,
    "매지컬 한손무기 마력 주문서": 3105,
    "프리미엄 악세서리 공격력 스크롤 100%": 2329,
    "프리미엄 펫장비 공격력 스크롤 100%": 2329,
    "프리미엄 악세서리 마력 스크롤 100%": 776,
    "프리미엄 펫장비 마력 스크롤 100%": 776,
    "안드로이드 이어센서 클립": 3105,
    "데미지 스킨 저장 슬롯 1칸 확장권": 6210,
    "영원한 환생의 불꽃": 10351,
    "티타늄 하트": 1035,
    "페어리 하트": 1449,
    "리튬 하트": 31052,
    "크리스탈 하트": 41402,
    "골드 하트": 62103,
    "기운찬 루시드의 소울": 207,
    "날렵한 루시드의 소울": 207,
    "총명한 루시드의 소울": 207,
    "놀라운 루시드의 소울": 207,
    "화려한 루시드의 소울": 207,
    "강력한 루시드의 소울": 207,
    "빛나는 루시드의 소울": 207,
    "강인한 루시드의 소울": 207,
    "영원히 꺼지지 않는 불꽃 조각": 51753,
    "스페셜 소울 인챈터": 51753,
    "하프 이어링": 28982,
    "레드 워리어 마이스터 심볼": 28982,
    "레드 파이렛 마이스터 심볼": 28982,
    "레드 시프 마이스터 심볼": 28982,
    "레드 매지션 마이스터 심볼": 28982,
    "레드 아처 마이스터 심볼": 28982,
    "샤이니 레드 매지션 마이스터 심볼": 28982,
    "샤이니 레드 시프 마이스터 심볼": 28982,
    "샤이니 레드 워리어 마이스터 심볼": 28982,
    "샤이니 레드 아처 마이스터 심볼": 28982,
    "샤이니 레드 파이렛 마이스터 심볼": 28982,
    "베어스 퍼플 펜던트": 28982,
    "피콕스 퍼플 펜던트": 28982,
    "아울스 퍼플 펜던트": 28982,
    "울프스 퍼플 펜던트": 28982,
    "강인함의 익스트림 벨트": 28982,
    "지혜의 익스트림 벨트": 28982,
    "행운의 익스트림 벨트": 28982,
    "날카로운 익스트림 벨트": 28982,
    "펫장비 공격력 스크롤 100%": 62103,
    "펫장비 마력 스크롤 100%": 20701,
    "악세서리 공격력 스크롤 100%": 62103,
    "악세서리 마력 스크롤 100%": 20701,
    "에픽 잠재능력 부여 주문서 50%": 41402,
    "에디셔널 잠재능력 부여 주문서 70%": 51753,
    "황금 망치 100%": 62103,
    "기운찬 매그너스의 소울": 41402,
    "날렵한 매그너스의 소울": 41402,
    "총명한 매그너스의 소울": 41402,
    "놀라운 매그너스의 소울": 41402,
    "화려한 매그너스의 소울": 41402,
    "강력한 매그너스의 소울": 41402,
    "빛나는 매그너스의 소울": 41402,
    "강인한 매그너스의 소울": 41402,
    "기운찬 반반의 소울": 62103,
    "날렵한 반반의 소울": 62103,
    "총명한 반반의 소울": 62103,
    "놀라운 반반의 소울": 62103,
    "화려한 반반의 소울": 62103,
    "강력한 반반의 소울": 62103,
    "빛나는 반반의 소울": 62103,
    "강인한 반반의 소울": 62103,
    "기운찬 카리아인의 소울": 82805,
    "날렵한 카리아인의 소울": 82805,
    "총명한 카리아인의 소울": 82805,
    "놀라운 카리아인의 소울": 82805,
    "화려한 카리아인의 소울": 82805,
    "강력한 카리아인의 소울": 82805,
    "빛나는 카리아인의 소울": 82805,
    "강인한 카리아인의 소울": 82805,
    "소울 분해기": 414023,
    "소울 20칸 가방": 155258,
    "식물용 20칸 가방": 155258,
    "광물용 20칸 가방": 155258,
    "제작물품 20칸 가방": 155258,
    "레시피 20칸 가방": 155258,
    "의자 20칸 가방": 155258,
    "칭호 20칸 명함 지갑": 155258,
    "주문서 20칸 가방": 155258,
    "현명한 피노키오 코": 207011,
    "행운의 피노키오 코": 207011,
    "민첩한 피노키오 코": 207011,
    "힘센 피노키오 코": 207011,
    "금빛 각인의 인장": 310517,
    "긍정의 혼돈 주문서 30%": 207011,
    "긍정의 혼돈 주문서 50%": 155258,
    "놀라운 혼돈의 주문서 50%": 155258,
    "놀라운 혼돈의 주문서 60%": 155258,
    "놀라운 혼돈의 주문서 70%": 103506,
    "순백의 주문서 10%": 155258,
    "순백의 주문서 5%": 207011,
    "은빛 각인의 인장": 207011,
    "은빛 에디셔널 각인의 인장": 207011,
    "황금 망치 50%": 207011,
    "미라클 악세서리 공격력 주문서 50%": 362270,
    "미라클 악세서리 마력 주문서 50%": 51753,
    "악세서리 공격력 주문서 70%": 362270,
    "악세서리 마력 주문서 70%": 51753,
    "미라클 펫장비 공격력 주문서 50%": 207011,
    "미라클 펫장비 마력 주문서 50%": 207011,
    "펫장비 공격력 주문서 70%": 207011,
    "펫장비 마력 주문서 70%": 207011,
    "미라클 방어구 공격력 주문서 50%": 310517,
    "미라클 방어구 마력 주문서 50%": 103506,
    "방어구 공격력 주문서 70%": 207011,
    "방어구 마력 주문서 70%": 207011
}

module.exports = {
    usage: `${client.prefix}골드애플 (횟수)`,
    command: ["골드애플", "ㄱㄷㅇㅍ", "독사과", "ㄷㅅㄱ"],
    description: `- 1 ~ 20000 범위의 횟수를 입력하면 그만큼의 골드애플 시뮬을 수행합니다.\n- 참고. ${client.prefix}골드애플 확률`,
    type: ["메이플"],
    async execute(message, args) {
        if (args.length > 1) {
            return message.channel.send(`**${this.usage}**\n- 대체 명령어: ${this.command.join(', ')}\n${this.description}`);
        }
        if (args[0] == '확률' || args[0] == 'ㅎㄹ') {
            let rslt = `<골드애플 확률>`;
            for (let key in proper)
                rslt += `\n${key}: ${proper[key] / 100000}%`;
            return message.channel.send(rslt, { split: true });
        }

        const count = +(args[0] ?? 1);
        if (isNaN(count) || count < 1 || count > 20000) {
            return message.channel.send('1 ~ 20000 범위의 숫자만 입력가능합니다.');
        }

        // count는 골드애플 횟수
        // random은 0이상 1미만
        const list = {}; // 횟수 담을 객체
        let propsum = 0; // 확률표의 확률값의 합
        for (let key in proper) {
            list[key] = 0;
            propsum += proper[key];
        }
        for (let i = 0; i < count; i++) {
            const now = Math.floor(Math.random() * propsum + 1);
            let sum = 0;
            for (let key in proper) {
                sum += proper[key];
                if (now <= sum) {
                    list[key]++;
                    break;
                }
            }
        }

        let rslt = `골드애플 ${count}회 결과\n`;
        for (let key in list) {
            if (list[key] != 0) {
                rslt += `\n${key}: ${list[key]}회`;
            }
        }
        return message.channel.send(rslt, { split: true });
    }
};