const proper = {
    "위대한 데미안의 소울": 113,
    "위대한 파풀라투스의 소울": 40964,
    "위대한 핑크빈의 소울": 61446,
    "위대한 아카이럼의 소울": 81928,
    "타임로이드(남) 교환권": 2048,
    "타임로이드(여) 교환권": 205,
    "뽀송 라벤더 스킨 안드로이드 변경권": 1024,
    "홍조 라벤더 스킨 안드로이드 변경권": 1024,
    "마스터 쉐도우 데미지 스킨": 3072,
    "메리 고 라운드 의자": 20482,
    "노닥노닥 의자": 40964,
    "오로라 돌고래 라이딩 (영구) 교환권": 10241,
    "오로라 돌고래 라이딩 (90일) 교환권": 40964,
    "돌돌 극세사 이불말이 라이딩 (영구) 교환권": 20482,
    "돌돌 극세사 이불말이 라이딩 (90일) 교환권": 81928,
    "매지컬 한손무기 공격력 주문서": 4608,
    "매지컬 두손무기 공격력 주문서": 4608,
    "매지컬 한손무기 마력 주문서": 3072,
    "프리미엄 악세서리 공격력 스크롤 100%": 2304,
    "프리미엄 펫장비 공격력 스크롤 100%": 2304,
    "프리미엄 악세서리 마력 스크롤 100%": 768,
    "프리미엄 펫장비 마력 스크롤 100%": 768,
    "안드로이드 이어센서 클립": 3072,
    "데미지 스킨 저장 슬롯 1칸 확장권": 6145,
    "영원한 환생의 불꽃": 10241,
    "티타늄 하트": 1024,
    "페어리 하트": 1434,
    "리튬 하트": 30723,
    "크리스탈 하트": 40964,
    "골드 하트": 61446,
    "기운찬 데미안의 소울": 2048,
    "날렵한 데미안의 소울": 2048,
    "총명한 데미안의 소울": 2048,
    "놀라운 데미안의 소울": 2048,
    "화려한 데미안의 소울": 2048,
    "강력한 데미안의 소울": 2048,
    "빛나는 데미안의 소울": 2048,
    "강인한 데미안의 소울": 2048,
    "영원히 꺼지지 않는 불꽃 조각": 51205,
    "스페셜 소울 인챈터": 51205,
    "하프 이어링": 28675,
    "레드 워리어 마이스터 심볼": 28675,
    "레드 파이렛 마이스터 심볼": 28675,
    "레드 시프 마이스터 심볼": 28675,
    "레드 매지션 마이스터 심볼": 28675,
    "레드 아처 마이스터 심볼": 28675,
    "샤이니 레드 매지션 마이스터 심볼": 28675,
    "샤이니 레드 시프 마이스터 심볼": 28675,
    "샤이니 레드 워리어 마이스터 심볼": 28675,
    "샤이니 레드 아처 마이스터 심볼": 28675,
    "샤이니 레드 파이렛 마이스터 심볼": 28675,
    "베어스 퍼플 펜던트": 28675,
    "피콕스 퍼플 펜던트": 28675,
    "아울스 퍼플 펜던트": 28675,
    "울프스 퍼플 펜던트": 28675,
    "강인함의 익스트림 벨트": 28675,
    "지혜의 익스트림 벨트": 28675,
    "행운의 익스트림 벨트": 28675,
    "날카로운 익스트림 벨트": 28675,
    "펫장비 공격력 스크롤 100%": 61446,
    "펫장비 마력 스크롤 100%": 20482,
    "악세서리 공격력 스크롤 100%": 61446,
    "악세서리 마력 스크롤 100%": 20482,
    "에픽 잠재능력 부여 주문서 50%": 40964,
    "에디셔널 잠재능력 부여 주문서 70%": 51205,
    "황금 망치 100%": 61446,
    "기운찬 파풀라투스의 소울": 40964,
    "날렵한 파풀라투스의 소울": 40964,
    "총명한 파풀라투스의 소울": 40964,
    "놀라운 파풀라투스의 소울": 40964,
    "화려한 파풀라투스의 소울": 40964,
    "강력한 파풀라투스의 소울": 40964,
    "빛나는 파풀라투스의 소울": 40964,
    "강인한 파풀라투스의 소울": 40964,
    "기운찬 핑크빈의 소울": 61446,
    "날렵한 핑크빈의 소울": 61446,
    "총명한 핑크빈의 소울": 61446,
    "놀라운 핑크빈의 소울": 61446,
    "화려한 핑크빈의 소울": 61446,
    "강력한 핑크빈의 소울": 61446,
    "빛나는 핑크빈의 소울": 61446,
    "강인한 핑크빈의 소울": 61446,
    "기운찬 아카이럼의 소울": 81928,
    "날렵한 아카이럼의 소울": 81928,
    "총명한 아카이럼의 소울": 81928,
    "놀라운 아카이럼의 소울": 81928,
    "화려한 아카이럼의 소울": 81928,
    "강력한 아카이럼의 소울": 81928,
    "빛나는 아카이럼의 소울": 81928,
    "강인한 아카이럼의 소울": 81928,
    "소울 분해기": 409638,
    "소울 20칸 가방": 153614,
    "식물용 20칸 가방": 153614,
    "광물용 20칸 가방": 153614,
    "제작물품 20칸 가방": 153614,
    "레시피 20칸 가방": 153614,
    "의자 20칸 가방": 153614,
    "칭호 20칸 명함 지갑": 153614,
    "주문서 20칸 가방": 153614,
    "현명한 피노키오 코": 204819,
    "행운의 피노키오 코": 204819,
    "민첩한 피노키오 코": 204819,
    "힘센 피노키오 코": 204819,
    "금빛 각인의 인장": 307229,
    "긍정의 혼돈 주문서 30%": 204819,
    "긍정의 혼돈 주문서 50%": 153614,
    "놀라운 혼돈의 주문서 50%": 153614,
    "놀라운 혼돈의 주문서 60%": 153614,
    "놀라운 혼돈의 주문서 70%": 102410,
    "순백의 주문서 10%": 153614,
    "순백의 주문서 5%": 204819,
    "은빛 각인의 인장": 204819,
    "은빛 에디셔널 각인의 인장": 204819,
    "황금 망치 50%": 204819,
    "미라클 악세서리 공격력 주문서 50%": 358434,
    "미라클 악세서리 마력 주문서 50%": 51205,
    "악세서리 공격력 주문서 70%": 358434,
    "악세서리 마력 주문서 70%": 51205,
    "미라클 펫장비 공격력 주문서 50%": 204819,
    "미라클 펫장비 마력 주문서 50%": 204819,
    "펫장비 공격력 주문서 70%": 204819,
    "펫장비 마력 주문서 70%": 204819,
    "미라클 방어구 공격력 주문서 50%": 307229,
    "미라클 방어구 마력 주문서 50%": 102410,
    "방어구 공격력 주문서 70%": 204819,
    "방어구 마력 주문서 70%": 204819
}

module.exports = {
    usage: `${client.prefix}골드애플 (횟수)`,
    command: ["골드애플", "ㄱㄷㅇㅍ", "독사과", "ㄷㅅㄱ"],
    description: `- 1 ~ 20000 범위의 횟수를 입력하면 그만큼의 골드애플 시뮬을 수행합니다.\n- 참고. ${client.prefix}골드애플 확률`,
    type: ["메이플"],
    async execute(message, args) {
        if (args.length != 1) {
            return message.channel.send(`**${this.usage}**\n- 대체 명령어: ${this.command.join(', ')}\n${this.description}`);
        }
        if (args[0] == '확률' || args[0] == 'ㅎㄹ') {
            let rslt = `<골드애플 확률>\n`;
            for (let key in proper)
                rslt += `${key} : ${proper[key] / 100000}%\n`;
            return message.channel.send(rslt.trimEnd(), { split: true });
        }
        if (+args[0] < 1 || +args[0] > 20000 || isNaN(args[0])) {
            return message.channel.send('1 ~ 20000 범위의 숫자만 입력가능합니다.');
        }
        // args[0]은 골드애플 횟수
        // random은 0이상 1미만
        const list = {}; // 횟수 담을 객체
        let propsum = 0; // 확률표의 확률값의 합
        for (let key in proper) {
            list[key] = 0;
            propsum += proper[key];
        }
        for (let i = 0; i < +args[0]; i++) {
            const now = Math.floor(Math.random() * propsum + 1);
            let sum = 0;
            for (let key in proper) {
                sum += proper[key];
                if (now <= sum) {
                    list[key]++;
                    break;
                }
            }
        }

        let rslt = `골드애플 ${args[0]}회 결과\n\n`;
        for (let key in list) {
            if (list[key] != 0) {
                rslt += `${key}: ${list[key]}회\n`;
            }
        }
        return message.channel.send(rslt.trimEnd(), { split: true });
    }
};